Revit 2024 API
FabricationSaveJobOptions Class
 Options for FabricationPart.SaveAsFabricationJob() method.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class FabricationSaveJobOptions : IDisposable
Visual Basic
Public Class FabricationSaveJobOptions _
	Implements IDisposable
Visual C++
public ref class FabricationSaveJobOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions
See Also
FabricationSaveJobOptions Members
Autodesk.Revit.DB.Fabrication Namespace